<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads ArchiCAD19 and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.filipp.autopkg-recipes.ArchiCAD19Update.munki</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>NAME</key>
        <string>ArchiCAD19</string>
        <key>URL</key>
        <string>http://gscdn.graphisoft.com/cdn/AC/19/FIN/AC/AC19-3003-FIN.dmg</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%pathname%/ArchiCAD 19/ArchiCAD Installer.app/Contents/Info.plist</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>pkginfo</key>
                <dict>
                    <key>description</key>
                    <string>ArchiCAD 19 offers a streamlined workflow solution, keeping architects in the state of the creative design flow with as little disruption as possible.</string>
                    <key>installer_type</key>
                    <string>copy_from_dmg</string>
                    <key>installs</key>
                    <array>
                        <dict>
                            <key>CFBundleIdentifier</key>
                            <string>com.graphisoft.ArchiCAD</string>
                            <key>CFBundleName</key>
                            <string>ArchiCAD</string>
                            <key>CFBundleVersion</key>
                            <string>%version%</string>
                            <key>minosversion</key>
                            <string>10.8.0</string>
                            <key>path</key>
                            <string>/Applications/GRAPHISOFT/ArchiCAD 19/ArchiCAD 19.app</string>
                            <key>type</key>
                            <string>application</string>
                            <key>version_comparison_key</key>
                            <string>CFBundleVersion</string>
                        </dict>
                    </array>
                    <key>items_to_copy</key>
                    <array>
                        <dict>
                            <key>destination_path</key>
                            <string>/tmp</string>
                            <key>group</key>
                            <string>admin</string>
                            <key>mode</key>
                            <string>go-w</string>
                            <key>source_item</key>
                            <string>ArchiCAD 19/ArchiCAD Installer.app</string>
                            <key>user</key>
                            <string>root</string>
                        </dict>
                    </array>
                    <key>name</key>
                    <string>%NAME%</string>
                    <key>postinstall_script</key>
                    <string>#!/bin/sh
                    JAR="/tmp/ArchiCAD Installer.app/Contents/Resources/Java/archive.jar"
                    JAVA="/Library/Internet Plugins/JavaAppletPlugin.plugin/Contents/Home/bin/java"
                    launchctl asuser 0 "$JAVA" -jar "$JAR" -silent
                    exit $?
                    </string>
                    <key>requires</key>
                    <array>
                        <string>CodeMeter</string>
                    </array>
                    <key>uninstall_method</key>
                    <string>uninstall_script</string>
                    <key>uninstall_script</key>
                    <string>#!/bin/sh
                    JAR="/Applications/GRAPHISOFT/ArchiCAD 19/Uninstall.AC/archive.jar"
                    JAVA="/Library/Internet Plugins/JavaAppletPlugin.plugin/Contents/Home/bin/java"
                    launchctl asuser 0 "$JAVA" -jar "$JAR" -silent
                    exit $?
                    </string>
                    <key>version</key>
                    <string>%version%</string>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>