<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest Maxwell Render plugin for ArchiCAD</string>
    <key>Identifier</key>
    <string>com.github.filipp.autopkg-recipes.ArchiCADMaxwellPlugin.munki</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>MaxwellRender</string>
        <key>DOWNLOAD_URL</key>
        <string>http://77.92.72.90/tl/489766781458806039/ac2mxs_v3.2.0_osx.zip</string>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
