<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Imports latest version of CodeMeter into a Munki repo.</string>
    <key>Identifier</key>
    <string>com.github.filipp.autopkg-recipes.CodeMeter.munki</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>CodeMeter</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps</string>
        <key>MUNKI_CATEGORY</key>
        <string>Licensing</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>description</key>
            <string>The CodeMeter Runtime for Mac OS X supports the CmStick, the CmStick/M and the CmCard/Express.</string>
            <key>developer</key>
            <string>Wibu Systems</string>
            <key>display_name</key>
            <string>CodeMeter</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>